_a = 'あいうえお'
_k = 'かきくけこ'
_s = 'さしすせそ'
_t = 'たちつてと'
_n = 'なにぬねの'
_h = 'はひふへほ'
_m = 'まみむめも'
_y = 'やいゆえよ'
_r = 'らりるれろ'
_w = 'わゐうゑを'
_nn = 'ん'
_g = 'がぎぐげご'
_z = 'ざじずぜぞ'
_d = 'だぢづでど'
_b = 'ばびぶべぼ'
_p = 'ぱぴぷぺぽ'
_v = 'ゔ'


YOMI_TO_GYO = {
    'ア': _a,
    'イ': _a,
    'ウ': _a,
    'エ': _a,
    'オ': _a,
    'カ': _k,
    'キ': _k,
    'ク': _k,
    'ケ': _k,
    'コ': _k,
    'サ': _s,
    'シ': _s,
    'ス': _s,
    'セ': _s,
    'ソ': _s,
    'タ': _t,
    'チ': _t,
    'ツ': _t,
    'テ': _t,
    'ト': _t,
    'ナ': _n,
    'ニ': _n,
    'ヌ': _n,
    'ネ': _n,
    'ノ': _n,
    'ハ': _h,
    'ヒ': _h,
    'フ': _h,
    'ヘ': _h,
    'ホ': _h,
    'マ': _m,
    'ミ': _m,
    'ム': _m,
    'メ': _m,
    'モ': _m,
    'ヤ': _y,
    'ユ': _y,
    'ヨ': _y,
    'ラ': _r,
    'リ': _r,
    'ル': _r,
    'レ': _r,
    'ロ': _r,
    'ワ': _w,
    'ヰ': _w,
    'ヱ': _w,
    'ヲ': _w,
    'ン': _nn,
    'ガ': _g,
    'ギ': _g,
    'グ': _g,
    'ゲ': _g,
    'ゴ': _g,
    'ザ': _z,
    'ジ': _z,
    'ズ': _z,
    'ゼ': _z,
    'ゾ': _z,
    'ダ': _d,
    'ヂ': _d,
    'ヅ': _d,
    'デ': _d,
    'ド': _d,
    'バ': _b,
    'ビ': _b,
    'ブ': _b,
    'ベ': _b,
    'ボ': _b,
    'パ': _p,
    'ピ': _p,
    'プ': _p,
    'ペ': _p,
    'ポ': _p,
    'ヴ': _v
}
